app/controllers/app_controller.rb

    def cats
        @categories= Category.all
---
SELECT "categories".* FROM "categories"