app/controllers/carts_controller.rb

  def create
    @cart = current_user.carts.build(cart_params)

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("item", "quantity", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["item", "brufen"], ["quantity", 1], ["price", "20.0"], ["user_id", 1], ["created_at", "2021-02-16 19:37:46.984982"], ["updated_at", "2021-02-16 19:37:46.984982"]]