app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "cough"], ["created_at", "2021-02-16 03:44:06.046488"], ["updated_at", "2021-02-16 03:44:06.046488"]]

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE "categories" SET "updated_at" = ? WHERE "categories"."id" = ?  [["updated_at", "2021-02-14 17:20:58.915383"], ["id", 1]]

  def destroy
    @category.destroy
---
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 1]]