app/controllers/medications_controller.rb

SELECT "medications".* FROM "medications"
---
  def index
    @medications = Medication.all

SELECT "categories".* FROM "categories"
---
  def new
    @medication = Medication.new
    @categories = Category.all

SELECT "categories".* FROM "categories"
---
  def edit
    @categories = Category.all

INSERT INTO "medications" ("name", "description", "price", "ingredients", "shape", "dose", "quantity", "availability", "created_at", "updated_at", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @medication = Medication.new(medication_params)

    respond_to do |format|
      if @medication.save

UPDATE "medications" SET "description" = ?, "price" = ?, "ingredients" = ?, "dose" = ?, "quantity" = ?, "updated_at" = ? WHERE "medications"."id" = ?  [["description", "A good drug for migraine."], ["price", 13.0], ["ingredients", "Ergot caffiene"], ["dose", "1"], ["quantity", 3], ["updated_at", "2021-02-15 03:28:14.463892"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @medication.update(medication_params)

DELETE FROM "medications" WHERE "medications"."id" = ?  [["id", 3]]
---
  def destroy
    @medication.destroy

SELECT "medications".* FROM "medications" WHERE "medications"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_medication
      @medication = Medication.find(params[:id])